src/test/resources/soap/multi-day-and-court-room-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:ns35="http://www.justice.gov.uk/magistrates/external/ExternalDocumentRequest">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>externalDocument</wsa:Action>
    <wsa:From>
      <wsa:Address>CP_NPS_ML</wsa:Address>
    </wsa:From>
    <wsa:MessageID>09233523-345b-4351-b623-5dsf35sgs5d6</wsa:MessageID>
    <wsa:RelatesTo>RelatesToValue</wsa:RelatesTo>
    <wsa:To>CP_NPS</wsa:To>
  </soap:Header>
  <soap:Body>
    <ns35:ExternalDocumentRequest>
      <documents>
        <document>
          <info>
            <source_file_name>5_26102020_2992_B10JQ01_ADULT_COURT_LIST_DAILY</source_file_name>
          </info>
          <data>
            <job>
              <printdate>14/11/2016</printdate>
              <username>gl.userone</username>
              <late>N</late>
              <adbox>N</adbox>
              <means>N</means>
              <sessions>
                <session>
                  <ou_code>B10JQ01</ou_code>
                  <s_id>556805</s_id>
                  <doh>26/10/2020</doh>
                  <lja>South West London Magistrates; Court</lja>
                  <cmu>Gl Management Unit 1</cmu>
                  <panel>Adult Panel</panel>
                  <court>Sheffield Magistrates Court</court>
                  <room>00</room>
                  <sstart>09:00</sstart>
                  <send>12:00</send>
                  <blocks>
                    <block>
                      <sb_id>758095</sb_id>
                      <bstart>09:00</bstart>
                      <bend>12:00</bend>
                      <desc>First Hearings Slot</desc>
                      <cases>
                        <case>
                          <c_id>1218461</c_id>
                          <h_id>1294273</h_id>
                          <valid>Y</valid>
                          <caseno>166662981</caseno>
                          <type>C</type>
                          <def_name>MR CHRIS FAULKNER</def_name>
                          <def_dob>06/08/1968</def_dob>
                          <def_type>P</def_type>
                          <def_sex>F</def_sex>
                          <pnc_id>2020/0158178A</pnc_id>
                          <cro_number>CR0009900099</cro_number>
                          <def_addr>
                            <line1>1 High Street</line1>
                            <line5>Salisbury</line5>
                            <pcode>SP1 1AA</pcode>
                          </def_addr>
                          <inf>POL01</inf>
                          <cseq>2</cseq>
                          <listno>1st</listno>
                          <offences>
                            <offence>
                              <oseq>1</oseq>
                              <co_id>1185408</co_id>
                              <code>TH68010</code>
                              <maxpen>EW: 6M ;/or Ultd Fine</maxpen>
                              <title>Theft from a shop</title>
                              <sum>On 01/01/2016 at Town, stole Article, to the value of £100.00, belonging to Person.</sum>
                              <as>Contrary to section 1(1) and 7 of the Theft Act 1968.</as>
                            </offence>
                          </offences>
                        </case>
                      </cases>
                    </block>
                  </blocks>
                </session>
              </sessions>
            </job>
          </data>
        </document>
        <document>
          <info>
            <source_file_name>5_26102020_2992_B10JQ02_ADULT_COURT_LIST_DAILY</source_file_name>
          </info>
          <data>
            <job>
              <printdate>14/11/2016</printdate>
              <username>gl.userone</username>
              <late>N</late>
              <adbox>N</adbox>
              <means>N</means>
              <sessions>
                <session>
                  <ou_code>B10JQ02</ou_code>
                  <s_id>556805</s_id>
                  <doh>26/10/2020</doh>
                  <lja>South West London Magistrates; Court</lja>
                  <cmu>Gl Management Unit 1</cmu>
                  <panel>Adult Panel</panel>
                  <court>Sheffield Magistrates Court</court>
                  <room>00</room>
                  <sstart>09:00</sstart>
                  <send>12:00</send>
                  <blocks>
                    <block>
                      <sb_id>758095</sb_id>
                      <bstart>09:00</bstart>
                      <bend>12:00</bend>
                      <desc>First Hearings Slot</desc>
                      <cases>
                        <case>
                          <c_id>1218461</c_id>
                          <h_id>1294273</h_id>
                          <valid>Y</valid>
                          <caseno>266662981</caseno>
                          <type>C</type>
                          <def_name>MR CHRIS FAULKNER</def_name>
                          <def_name_elements>
                            <title>Mr</title>
                            <forename1>Chris</forename1>
                            <surname>FAULKNER</surname>
                          </def_name_elements>
                          <def_dob>06/08/1968</def_dob>
                          <def_type>P</def_type>
                          <def_sex>F</def_sex>
                          <pnc_id>2020/0156178A</pnc_id>
                          <cro_number>CR0005100051</cro_number>
                          <def_addr>
                            <line1>1 Main Street</line1>
                            <line5>Bath</line5>
                            <pcode>BA1 1AA</pcode>
                          </def_addr>
                          <inf>POL01</inf>
                          <cseq>2</cseq>
                          <listno>1st</listno>
                          <offences>
                            <offence>
                              <oseq>1</oseq>
                              <co_id>1185408</co_id>
                              <code>TH68010</code>
                              <maxpen>EW: 6M ;/or Ultd Fine</maxpen>
                              <title>Theft from a shop</title>
                              <sum>On 01/01/2016 at Town, stole Article, to the value of £100.00, belonging to Person.</sum>
                              <as>Contrary to section 1(1) and 7 of the Theft Act 1968.</as>
                            </offence>
                          </offences>
                        </case>
                      </cases>
                    </block>
                  </blocks>
                </session>
              </sessions>
            </job>
          </data>
        </document>

        <document>
          <info>
            <source_file_name>5_27022020_2992_B10JQ01_ADULT_COURT_LIST_DAILY</source_file_name>
          </info>
          <data>
            <job>
              <printdate>14/11/2016</printdate>
              <username>gl.userone</username>
              <late>N</late>
              <adbox>N</adbox>
              <means>N</means>
              <sessions>
                <session>
                  <ou_code>B10JQ01</ou_code>
                  <s_id>556805</s_id>
                  <doh>26/10/2020</doh>
                  <lja>South West London Magistrates; Court</lja>
                  <cmu>Gl Management Unit 1</cmu>
                  <panel>Adult Panel</panel>
                  <court>Sheffield Magistrates Court</court>
                  <room>00</room>
                  <sstart>09:00</sstart>
                  <send>12:00</send>
                  <blocks>
                    <block>
                      <sb_id>758095</sb_id>
                      <bstart>09:00</bstart>
                      <bend>12:00</bend>
                      <desc>First Hearings Slot</desc>
                      <cases>
                        <case>
                          <c_id>1218461</c_id>
                          <h_id>1294273</h_id>
                          <valid>Y</valid>
                          <caseno>366662981</caseno>
                          <type>C</type>
                          <def_name>MR CHRIS FAULKNER</def_name>
                          <def_dob>06/08/1968</def_dob>
                          <def_type>P</def_type>
                          <def_sex>F</def_sex>
                          <def_addr>
                            <line1>A1</line1>
                          </def_addr>
                          <inf>POL01</inf>
                          <cseq>2</cseq>
                          <listno>1st</listno>
                          <offences>
                            <offence>
                              <oseq>1</oseq>
                              <co_id>1185408</co_id>
                              <code>TH68010</code>
                              <maxpen>EW: 6M ;/or Ultd Fine</maxpen>
                              <title>Theft from a shop</title>
                              <sum>On 01/01/2016 at Town, stole Article, to the value of £100.00, belonging to Person.</sum>
                              <as>Contrary to section 1(1) and 7 of the Theft Act 1968.</as>
                            </offence>
                          </offences>
                        </case>
                      </cases>
                    </block>
                  </blocks>
                </session>
              </sessions>
            </job>
          </data>
        </document>
      </documents>
    </ns35:ExternalDocumentRequest>
  </soap:Body>
</soap:Envelope>
